_app/_posts/mobile/2016-08-23-pc-change-rec.html
---
layout: post
title: pc change rec
date: 2016-08-23
categories: 
- mobile
tags: 
- pc
- 修改
- 记录
author: yefeiyu
excerpt: 日常修改的记录
---


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-06-01 四&gt;</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
chane the _app/assets/themes/curtana/_less/common.less<br >
table {<br >
</p>

<p>
tr:nth-child(even){background-color: #f5f2ff}<br >
</p>

<p>
th {<br >
    background-color: #cC0Ff0;<br >
    color: white;<br >
}<br >
     // TODO: responsive table support<br >
</p>
<ul class="org-ul">
<li>// display: inline-block;<br >
</li>
<li>// overflow-x: auto;<br >
</li>
<li>// white-space: nowrap;<br >
</li>
<li>display: inline-block;<br >
</li>
<li>overflow-x: auto;<br >
</li>
<li>white-space: nowrap;<br >
</li>
</ul>
<p>
}<br >
and then the TABLE had 横拉滚动条<br >
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-04-14 五&gt;</span></span></h2>
<div class="outline-text-2" id="text-2">
<p>
A friend sent me an email with a JPEG photo in the middle of the text. The picture is so big, most of it is outside the screen and I want to view it with an outside image viewer and not in Gnus. How do I save an image that is included in the email in Gnus, if it's not just an ordinary attachment?<br >
</p>

<p>
The command you need is gnus-summary-save-parts. You have an inline image, which implies that you received an HTML mail. An inline image is an instance of a so-called MIME part, where MIME is an Internet standard governing email-related things such as non-text attachments.<br >
</p>

<p>
L ;;list all group of gnus<br >
X m ;;save image to ~/<br >
</p>

<p>
debian chrome extensions installation is not enabled.<br >
se /etc/environment<br >
CHROMIUM_FLAGS='&#x2013;enable-remote-extensions'<br >
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-04-13 四&gt;</span></span></h2>
<div class="outline-text-2" id="text-3">
<p>
export WINEARCH=win32<br >
export WINEPREFIX=$HOME/.mynewwine32prefix/<br >
</p>

<p>
bash winetricks dotnet30<br >
proxychains4 bash winetricks dotnet40<br >
</p>

<p>
wget kegel.com/wine/winetricks &amp;&amp; sh winetricks ie8 ;;this is too old.<br >
</p>

<p>
emacs: error while loading shared libraries: libpng12.so.0: cannot open shared object file: No such file or directory<br >
<a href="https://packages.debian.org/jessie/libpng12-0">https://packages.debian.org/jessie/libpng12-0</a><br >
s dpkg -i lib*<br >
s apt-get install -f<br >
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-03-02 四&gt;</span></span></h2>
<div class="outline-text-2" id="text-4">
<p>
install wine-qq on debian<br >
<a href="http://www.longene.org/forum/viewtopic.php?f=6&t=30516">http://www.longene.org/forum/viewtopic.php?f=6&t=30516</a><br >
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-01-24 二&gt;</span></span></h2>
<div class="outline-text-2" id="text-5">
<p>
change emacs' color in terminator, add this line to .bashrc<br >
export TERM=xterm-256color<br >
</p>

<p>
define terminator's default position, change the '.local/share/applications/terminator.desktop' to:<br >
terminator &#x2013;geometry=1200x900+0+0<br >
</p>

<p>
add the font of msyh.ttf<br >
</p>

<p>
define the font by #gnome-tweak-tool<br >
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-12-19 一&gt;</span></span></h2>
<div class="outline-text-2" id="text-6">
<p>
#spni -g n ;; to install npm's extension n<br >
#s n 7.2.1 ;;to install nodejs v7.2.1<br >
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-08-23 二&gt;</span></span></h2>
<div class="outline-text-2" id="text-7">
<p>
.emacs<br >
L625<br >
  (setq myvar/relative-filename (concat "<a href="http://yefeiyu.github.io/assets/img/">http://yefeiyu.github.io/assets/img/</a>" myvar/img-name))<br >
</p>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-08-25 四&gt;</span></span></h2>
<div class="outline-text-2" id="text-8">
<p>
sudo apt-get install bleachbit<br >
sudo apt-get install sweeper<br >
sudo apt-get remove sweeper<br >
sudo dpkg -i nautilus_nutstore_amd64.deb<br >
<span class="timestamp-wrapper"><span class="timestamp">&lt;2016-09-21 三&gt;</span></span><br >
install vmware debian and windows xp.<br >
debian:<br >
sai xfce4<br >
add 6 keyboads shortcut, such as emacs, conkeror, gnus<br >
change the desktop to 600x800, which need change the VGA1 to Virtual1<br >
rehook dropbox to <i>home/xx/Dropbox<br >
change conkerorrc's qiushi to 98%, and /</i>.<br >
</p>

<p>
eba<br >
alias gl='git pull'<br >
</p>
</div>
</div>
